<a href="https://colab.research.google.com/github/vicar1987/Data_Mining_class_practice/blob/main/DataMining_Pandas_%E8%8E%8A%E8%82%B2%E4%BF%AE.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

利用給各位的 employees.csv
1. 讀入data frame，稱為 data
2. sort by 'First Name'
3. 檢查有沒有 'First Name' 重複，以bool_series儲存之
4. 除去Duplications
5. 印出 data.head() data.info()
(如無把握請參考 Tibame_NDarrayIntro.ipynb )

In [ ]:
import pandas as pd
data = pd.read_csv("./employees.csv") 
print(data)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [ ]:
data[['First Name']]

    First Name
0      Douglas
1       Thomas
2        Maria
3        Jerry
4        Larry
..         ...
995      Henry
996    Phillip
997    Russell
998      Larry
999     Albert

[1000 rows x 1 columns]

In [ ]:
data.sort_values("First Name", inplace = True) 
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution

In [ ]:
bool_series = data["First Name"].duplicated() 
bool_series

101    False
327     True
440     True
937     True
137    False
       ...
902     True
925     True
946     True
947     True
951     True
Name: First Name, Length: 1000, dtype: bool

In [ ]:
data['bool_series'] = bool_series
print(data.head())

    First Name Gender Start Date Last Login Time  Salary  Bonus %  \
101      Aaron   Male  2/17/2012        10:20 AM   61602   11.849
327      Aaron   Male  1/29/1994         6:48 PM   58755    5.097
440      Aaron   Male  7/22/1990         2:53 PM   52119   11.343
937      Aaron    NaN  1/22/1986         7:39 PM   63126   18.424
137       Adam   Male  5/21/2011         1:45 AM   95327   15.120

    Senior Management             Team  bool_series
101              True        Marketing        False
327              True        Marketing         True
440              True  Client Services         True
937             False  Client Services         True
137             False     Distribution        False

In [ ]:
data = data[~bool_series] 
print(data.info())
print(data.head())
data

<class 'pandas.core.frame.DataFrame'>
Int64Index: 201 entries, 101 to 7
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         200 non-null    object
 1   Gender             171 non-null    object
 2   Start Date         201 non-null    object
 3   Last Login Time    201 non-null    object
 4   Salary             201 non-null    int64
 5   Bonus %            201 non-null    float64
 6   Senior Management  200 non-null    object
 7   Team               194 non-null    object
 8   bool_series        201 non-null    bool
dtypes: bool(1), float64(1), int64(1), object(6)
memory usage: 14.3+ KB
None
    First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
101      Aaron    Male  2/17/2012        10:20 AM   61602   11.849
137       Adam    Male  5/21/2011         1:45 AM   95327   15.120
300       Alan    Male  6/26/1988         3:54 AM  111786    3.592
959     Albert    Male  9/19/1992         2:35 AM   45094    5.850
988      Alice  Female  10/5/2004         9:34 AM   47638   11.209

    Senior Management                  Team  bool_series
101              True             Marketing        False
137             False          Distribution        False
300              True           Engineering        False
959              True  Business Development        False
988             False       Human Resources        False

<ipython-input-12-6c6062e54d56>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  data = data[~bool_series]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,bool_series
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing,False
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution,False
300,Alan,Male,6/26/1988,3:54 AM,111786,3.592,True,Engineering,False
959,Albert,Male,9/19/1992,2:35 AM,45094,5.850,True,Business Development,False
988,Alice,Female,10/5/2004,9:34 AM,47638,11.209,False,Human Resources,False
...,...,...,...,...,...,...,...,...,...
512,Wanda,Female,4/6/1993,3:11 AM,78883,19.695,False,NaN,False
943,Wayne,Male,9/8/2006,11:09 AM,67471,2.728,False,Engineering,False
941,William,Male,6/26/1997,8:33 AM,104840,15.653,True,Engineering,False
175,Willie,Male,2/17/1998,8:20 PM,146651,1.451,True,Engineering,False
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance,False